[
  {
    "id": 1,
    "title": "Browser-Support",
    "state": "January 2023",
    "reproduction": "+",
    "subtitle": "The WebXR API is not yet supported by all web browsers, and even when it is supported, the level of support can vary between browsers. This can make it difficult to ensure that an XR experience will work on all devices.",
    "source": "Due to different development cycles, hardware requirements, and prioritization of other technologies, full acccess to the API isnt available for most browsers. In those cases Polyfill allows for a rudamentory support.",
    "links": [
        {
          "title": "An Exploratory Study of Bugs in Extended Reality Applications on the Web",
          "source": "https://ieeexplore.ieee.org/abstract/document/9251053"
        },
        {
          "title": "How long do you want to maintain this thing? Understanding the Challenges Faced by WebXR Creators",
          "source": "https://dl.acm.org/doi/abs/10.1145/3485444.3495181"
        }
      ],
    "example": {
      "solved": "-",
      "active": true,
      "links": [
        {
          "title": "List of Supported Devices",
          "source": "https://immersiveweb.dev/#supporttable"
        },
        {
          "title": "Mozilla - Browser-Compatibility List",
          "source": "https://developer.mozilla.org/en-US/docs/Web/API/WebXR_Device_API#browser_compatibility"
        }
      ],
      "example": "",
      "explanation": "WebXR-polyfill is a JavaScript library that allows developers to use the WebXR API in browsers that do not support it natively, while providing a compatibility layer between the WebXR and the now obsolete WebVR API"
    },
    "solution": ""
  },
  {
    "id": 2,
    "title": "WebXR-Useability",
    "state": "December 2022",
    "reproduction": "+",
    "subtitle": "Still heavily evolving the Web-XR-API offers challenges for developer and user alike, often resulting in issues with various browsers and devices, as well as performance limitations, reducing it's overall usability.",
    "source": "Due to performance issues, compatibility difficulties with various browsers and devices, as well as ongoing changes to the APIs. These factors make it difficult for developers to create stable and consistent experiences for users, and for users to have a seamless experience across different platforms.",
    "links": 
      [
        {
          "title": "WebXR Standards and Accessibility Architecture Issues",
          "source": "https://www.w3.org/WAI/APA/wiki/WebXR_Standards_and_Accessibility_Architecture_Issues"
        },
        {
          "title": "How long do you want to maintain this thing? Understanding the Challenges Faced by WebXR Creators",
          "source": "https://dl.acm.org/doi/abs/10.1145/3485444.3495181"
        }
      ],
    "example": "",
    "solution": ""
  },
  {
    "id": 3,
    "title": "Web-XR-Sessions",
    "state": "February 2023",
    "reproduction": "b",
    "subtitle": "Web-XR offers multiple Session-Types and Featuresets some supported by Polyfill others not. This can end up problematic with multiple Fallback controlls having to be specified, if it should finally be fully cross-compatible",
    "source": "Experimentals & Development",
    "example": "",
    "solution": ""
  },
  {
    "id": 4,
    "title": "Performance-Test-Issue",
    "state": "February 2023",
    "reproduction": "b",
    "subtitle": "Due to its open nature webxr will inevitably also be used on devices that dont offer the required performance to present XR content in an acceptable manner. While a function to determine support is available with the supportsSession() in the WebXR API, it only determines rudimentary support. This is done by checking multiple Requirements as followed.",
    "source": "",
    "example": "",
    "solution": ""
  },
  {
    "id": 5,
    "title": "XRSpace-Threats",
    "state": "February 2023",
    "reproduction": "b",
    "subtitle": "Privacy and Security is one of the key foundations that standardized APIs have to uphold, which is something that is quite apparent in the GitHub issues especially with the candidate recommendations stage getting close as seen in not only the preparations for it but the relating review request. While most security requirements are fulfilled, there is still a small list of unaddressed security related topics that could pose a problem. While minor and hard to fix those could lead to profiling and data collection off of users and their environment.",
    "source": "https://github.com/immersive-web/webxr/issues/1114",
    "example": "",
    "solution": ""
  },
  {
    "id": 6,
    "title": "Device-Support",
    "state": "20.12.23",
    "reproduction": "b",
    "subtitle": "Compatibility is very important for accessibility because it enables users to access XR content on a wide range of devices and platforms. WebXR is designed to be cross-platform and accessible to as many users as possible, regardless of the device they are using or the platform they are on. If XR content is not compatible with certain devices or platforms, it can prevent users from accessing the content and limit its reach. This can be particularly problematic for users with disabilities or other accessibility needs, who may require specific devices or software to access WebXR content.",
    "source": "https://immersiveweb.dev/#supporttable",
    "example": "",
    "solution": ""
  },
  {
    "id": 7,
    "title": "Incompatible-Browser",
    "state": "20.12.23",
    "reproduction": "b",
    "subtitle": "WebXR Polyfill even if currently a saving grace for compatbility due to different development cycles, hardware requirements, and prioritization of other technologies in borwsers, has only limited support for WebXR but it offers unsupporting browsers at least partial support making experiences available for users.",
    "source": "https://immersiveweb.dev/#supporttable",
    "links": [
        {
          "title": "An Exploratory Study of Bugs in Extended Reality Applications on the Web",
          "source": "https://ieeexplore.ieee.org/abstract/document/9251053"
        },
        {
          "title": "How long do you want to maintain this thing? Understanding the Challenges Faced by WebXR Creators",
          "source": "https://dl.acm.org/doi/abs/10.1145/3485444.3495181"
        },
        {
          "title": "WebXR Polyfill GitHub",
          "source": "https://github.com/immersive-web/webxr-polyfill"
        }
      ],
    "example": "",
    "solution": {
      "solved": "-",
      "active": true,
      "links": "",
      "example": "",
      "explanation": "WebXR-polyfill is a JavaScript library that allows developers to use the WebXR API in browsers that do not support it natively, while providing a compatibility layer between the WebXR and the now obsolete WebVR API"
    }
  },
  {
    "id": 8,
    "title": "Experimentals",
    "state": "20.12.23",
    "reproduction": "b",
    "subtitle": "The utilization of experimental functions within the WebXR API can present a number of challenges, including a lack of browser support, potential instability, the possibility of deprecation, and security vulnerabilities. Additionally, device support for these experimental features may be limited.",
    "source": "https://developer.mozilla.org/en-US/docs/Web/API",
    "links": [
        {
          "title": "WebXR-Docs by Mozilla (Experimental Functions)",
          "source": "https://developer.mozilla.org/en-US/docs/Web/API"
        }
      ],
    "example": "",
    "solution": ""
  }
]